БухЭксп/InformationRegisters/CW_ДокументыОтчетаЭкспедитора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДокументыОтчетаЭкспедитора</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ОтчетЭкспедитора</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ОтчетЭкспедитора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Documents/CW_ОтчетЭкспедитора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_ОтчетЭкспедитора</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер_основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПеревставления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокЗаполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокПеревыставления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокПроведенияДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель_основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗначениеОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоСуммаВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНаПредоплату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНаПредоплату_Значение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормируютсясчетаФактуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗначенияОтбораПриКопировании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоСуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗатрат</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасходов</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьСчетФактура</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыВознаграждения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/CommonForms/CW_Печать/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("НеОтключатьИерархиюФорм"	, НеОтключатьИерархиюФорм);
	Параметры.Свойство("АдресПакета"				, АдресПакетаФорм);
	Параметры.Свойство("ЭтоПакетнаяПечать"			, ЭтоПакетнаяПечать);
	
	ДеревоСписок = истина;
	
	ОбновитьДанныеФормы(Параметры);	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы(Параметры)
	
	Если ЭтоАдресВременногоХранилища(Параметры.АдресОбъектовПечати) Тогда
		СписокОбъектовПечати.ЗагрузитьЗначения(ПолучитьИзВременногоХранилища(Параметры.АдресОбъектовПечати));
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(Параметры.АдресСписокПФ) Тогда
		СписокПечатныхФорм = ПолучитьИзВременногоХранилища(Параметры.АдресСписокПФ);
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресПакетаФорм) Тогда
		СтруктураПакета = ПолучитьИзВременногоХранилища(Параметры.АдресПакета);
		
		_ЗаполнитьДерево(СтруктураПакета,ДеревоПФ);
		
		УстановитьТекущуюСтрокуДерева(ДеревоПФ);
		ОбновитьОтображениеКнопки();
	Конецесли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазвернутьСтроки();
	
КонецПроцедуры

&наСервере
Процедура УстановитьТекущуюСтрокуДерева(Дерево)
	
	Если ДеревоСписок Тогда
		КоллекцияЭлементовДерева = Дерево.ПолучитьЭлементы();
		
		Для Каждого Строка Из КоллекцияЭлементовДерева Цикл 
			Если Строка.Группа Тогда
				УстановитьТекущуюСтрокуДерева(Строка);
				Возврат;
			Иначе
				Элементы.ДеревоПФ.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
				Возврат;
			КонецЕсли;
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция _ЗаполнитьДерево(Структура,Дерево, ВыводитьГруппы = Ложь)
	// --- 
	// Имя
	// Вид = {Корень;Группа;Элемент}
	// ПФ
	
	Если (Структура.Вид = "Элемент") Тогда
		
		СтрокаДерева 				= Дерево.ПолучитьЭлементы().Добавить();
		СтрокаДерева.Имя 			= Структура.Имя;
		СтрокаДерева.Представление 	= СтрокаДерева.Имя;
		СтрокаДерева.Группа 		= Ложь;
		СтрокаДерева.Картинка 		= 1;
		
		СтрокаДерева.Печать 		= ?(Структура.Печать=Истина,1,0);
		СтрокаДерева.Количество 	= Структура.Количество;
		СтрокаДерева.Адрес 			= ПоместитьВоВременноеХранилище(Структура.ПФ,ЭтаФорма.УникальныйИдентификатор);
		
		Если Структура.Свойство("АдресЭлПочты") Тогда
			СтрокаДерева.АдресЭлПочты = Структура.АдресЭлПочты;
		КонецЕсли;
		Если Структура.Свойство("АдресЭлПочтыКопия") Тогда
			СтрокаДерева.АдресЭлПочтыКопия = Структура.АдресЭлПочтыКопия;
		КонецЕсли;
		Если Структура.Свойство("АдресЭлПочтыСкрытаяКопия") Тогда
			СтрокаДерева.АдресЭлПочтыСкрытаяКопия = Структура.АдресЭлПочтыСкрытаяКопия; 
		КонецЕсли;
		
		Если Структура.Свойство("ШаблонПисьма") Тогда
			СтрокаДерева.ШаблонПисьма = Структура.ШаблонПисьма;
		КонецЕсли;
		
		Если Структура.Свойство("ДанныеДляЗаполненияШаблона") Тогда
			СтрокаДерева.ДанныеДляЗаполненияШаблона	= Структура.ДанныеДляЗаполненияШаблона;
		КонецЕсли;
		
		Если Структура.Свойство("НавигационнаяСсылка") Тогда
			СтрокаДерева.НавигационнаяСсылка 				= Структура.НавигационнаяСсылка;
			СтрокаДерева.НавигационнаяСсылкаПредставление 	= Структура.НавигационнаяСсылкаПредставление;
		КонецЕсли;
		
		СтрокаДерева.Ссылка = Структура.Ссылка;
		
		Возврат(Истина);
		
	КонецЕсли; 
	
	Если (Структура.Вид = "Группа") Тогда
		
		Если ВыводитьГруппы или НеОтключатьИерархиюФорм Тогда
			СтрокаДерева 				= Дерево.ПолучитьЭлементы().Добавить();
			СтрокаДерева.Имя 			= Структура.Имя;
			СтрокаДерева.Представление 	= СтрокаДерева.Имя;
			СтрокаДерева.Группа 		= Истина;
			СтрокаДерева.Картинка 		= 0;
		Иначе
			СтрокаДерева 				= Дерево;
		КонецЕсли;
		
		Для каждого Элемент Из Структура.Элементы Цикл
			_ЗаполнитьДерево(Элемент,СтрокаДерева);
		КонецЦикла; 
		
		Возврат(Истина);
		
	КонецЕсли; 
	
	// --- 
	
	Если (Структура.Вид = "Корень") Тогда
		
		ОдинДокумент = Структура.Элементы.Количество()=1;
		
		ВывестиИерархию = Не ОдинДокумент И ДеревоСписок;
		ДеревоСписок 	= ВывестиИерархию;
		
		Для каждого Элемент Из Структура.Элементы Цикл
			_ЗаполнитьДерево(Элемент, Дерево, ВывестиИерархию);
		КонецЦикла; 
		
		Возврат(Истина);
		
	КонецЕсли; 
	
	// --- 
КонецФункции


&НаКлиенте
Процедура ДеревоПФПриАктивизацииСтроки(Элемент)
	
	ТД = Элементы.ДеревоПФ.ТекущиеДанные;
	Если (ТД = Неопределено) Тогда
		Возврат;
	КонецЕсли; 
	Если (НЕ ТД.Группа) Тогда
		
		_ЗагрузитьПФ(ТД.Адрес);
		
		Элементы.ТекущийТД.ТолькоПросмотр = Истина;
		Элементы.ТекущийТД.ОтображатьСетку = Ложь;
		Элементы.ТекущийТД.ОтображатьЗаголовки = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ЗагрузитьПФ(Адрес)
	// --- 
	
	ТекущийТД = ПолучитьИзВременногоХранилища(Адрес);
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КоличествоПлюс(Команда)
	
	ТД = Элементы.ДеревоПФ.ТекущиеДанные;
	Если (ТД <> Неопределено) Тогда
		
		Если (НЕ ТД.Группа) Тогда
			
			ТД.Количество = ТД.Количество+1;
			ПриИзмененииКоличества();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура КоличествоМинус(Команда)
	
	ТД = Элементы.ДеревоПФ.ТекущиеДанные;
	Если (ТД <> Неопределено) Тогда
		
		Если (НЕ ТД.Группа) Тогда
			
			Если (ТД.Количество > 0) Тогда
				
				ТД.Количество = ТД.Количество-1;
				ПриИзмененииКоличества();
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоПФКоличествоЭкземпляровПриИзменении(Элемент)
	
	ПриИзмененииКоличества();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКоличества()
	// --- 
	
	ТД = Элементы.ДеревоПФ.ТекущиеДанные;
	// --- 
	Если (ТД.Количество = 0 И ТД.Печать <> 0) Тогда
		
		ТД.Печать = 0;
		ОбновитьФлаги();
		
	ИначеЕсли (ТД.Количество <> 0 И ТД.Печать = 0) Тогда 
		
		ТД.Печать = 1;
		ОбновитьФлаги();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПФФлагПечатиПриИзменении(Элемент)
	
	ТД = Элементы.ДеревоПФ.ТекущиеДанные;
	Если (ТД.Печать = 2) Тогда
		ТД.Печать = 0;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ОбновитьФлаги()
	// --- 
	
	ТД = Элементы.ДеревоПФ.ТекущиеДанные;
	// --- 
	
	УстановитьФлагРодителя(ТД);
	Если (ТД.Группа) Тогда
		УстановитьФлагиСтрок(ТД,ТД.Печать);
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаКлиенте
Процедура УстановитьФлагРодителя(СтрокаДерева) Экспорт
	
	СтрокаРодитель = СтрокаДерева.ПолучитьРодителя();
	Если СтрокаРодитель = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// --- 
	
	ЕстьИстина = Ложь;
	ЕстьЛожь = Ложь;
	
	Для каждого Стр Из СтрокаРодитель.ПолучитьЭлементы() Цикл
		
		Если Стр.Печать = 1 Тогда
			
			ЕстьИстина = Истина;
			
		КонецЕсли;
		
		Если Стр.Печать = 0 Тогда
			
			ЕстьЛожь = Истина;
			
		КонецЕсли;
		
		Если Стр.Печать = 2 Тогда
			
			ЕстьИстина = Истина;
			ЕстьЛожь = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// --- 
	
	Если ЕстьИстина И ЕстьЛожь Тогда
		
		СтрокаРодитель.Печать = 2;
		
	ИначеЕсли ЕстьИстина И НЕ ЕстьЛожь Тогда
		
		СтрокаРодитель.Печать = 1;
		
	ИначеЕсли НЕ ЕстьИстина И ЕстьЛожь Тогда
		
		СтрокаРодитель.Печать = 0;
		
	КонецЕсли;
	
	УстановитьФлагРодителя(СтрокаРодитель);
	
КонецПроцедуры // УстановитьФлагРодителя()

&НаКлиенте
Процедура УстановитьФлагиСтрок(СтрокаДерева,Значение) Экспорт
	
	Для каждого Стр Из СтрокаДерева.ПолучитьЭлементы() Цикл
		
		Стр.Печать = Значение;
		УстановитьФлагиСтрок(Стр, Значение);
		
	КонецЦикла;
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ФлагПечатиУстановить(Команда)
	
	УстановитьЗначениеФлагов(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагПечатиСнять(Команда)
	
	УстановитьЗначениеФлагов(0);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеФлагов(Значение)
	// --- 
	
	Для каждого Стр Из ДеревоПФ.ПолучитьЭлементы() Цикл
		
		Стр.Печать = Значение;
		УстановитьФлагиСтрок(Стр,Стр.Печать);
		
	КонецЦикла;
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Функция ПолучитьФорматыПакета()
	
	СписокВыбораФормата = Новый СписокЗначений;
	СписокВыбораФормата.Добавить(ТипФайлаПакетаОтображаемыхДокументов.PDF	,"Документ PDF(*.pdf)"				,,БиблиотекаКартинок.CW_ДокументPDF);
	СписокВыбораФормата.Добавить(ТипФайлаПакетаОтображаемыхДокументов.XLS	,"Лист Excel (*.xls)"				,,БиблиотекаКартинок.CW_Excel);
	СписокВыбораФормата.Добавить(ТипФайлаПакетаОтображаемыхДокументов.XLSX	,"Лист Excel 2007-... (*.xlsx)"		,,БиблиотекаКартинок.CW_Excel);
	СписокВыбораФормата.Добавить(ТипФайлаПакетаОтображаемыхДокументов.ODS	,"Электронная таблица ODF (*.ods)"	,,БиблиотекаКартинок.CW_Excel);
	СписокВыбораФормата.Добавить(ТипФайлаПакетаОтображаемыхДокументов.DOCX	,"Документ Word (*.docx)"			,,БиблиотекаКартинок.CW_ДокументWord);
	
	СписокВыбораФормата.Добавить(ТипФайлаПакетаОтображаемыхДокументов.HTML4	,"Документ HTML 4 (*.htm)"			,,БиблиотекаКартинок.ФорматHTML);
	СписокВыбораФормата.Добавить(ТипФайлаПакетаОтображаемыхДокументов.HTML5	,"Документ HTML 5 (*.htm)"			,,БиблиотекаКартинок.ФорматHTML);
	
	Возврат СписокВыбораФормата;
	
КонецФункции

&НаКлиенте
Функция ПолучитьФорматыТабличногоДоумента()
	
	
	СписокВыбораФормата = Новый СписокЗначений;
	СписокВыбораФормата.Добавить(ТипФайлаТабличногоДокумента.PDF	,"Документ PDF(*.pdf)"				,,БиблиотекаКартинок.CW_ДокументPDF);
	СписокВыбораФормата.Добавить(ТипФайлаТабличногоДокумента.MXL	,"Табличный документ MXL (*.mxl)"	,,БиблиотекаКартинок.CW_ДокументСписок);
	СписокВыбораФормата.Добавить(ТипФайлаТабличногоДокумента.MXL7	,"Табличный документ MXL 7 (*.mxl)"	,,БиблиотекаКартинок.CW_ДокументСписок);
	СписокВыбораФормата.Добавить(ТипФайлаТабличногоДокумента.XLS	,"Лист Excel (*.xls)"				,,БиблиотекаКартинок.CW_Excel);
	СписокВыбораФормата.Добавить(ТипФайлаТабличногоДокумента.XLSX	,"Лист Excel 2007-... (*.xlsx)"		,,БиблиотекаКартинок.CW_Excel);
	СписокВыбораФормата.Добавить(ТипФайлаТабличногоДокумента.ODS	,"Электронная таблица ODF (*.ods)"	,,БиблиотекаКартинок.CW_Excel);
	СписокВыбораФормата.Добавить(ТипФайлаТабличногоДокумента.DOCX	,"Документ Word (*.docx)"			,,БиблиотекаКартинок.CW_ДокументWord);
	
	СписокВыбораФормата.Добавить(ТипФайлаТабличногоДокумента.HTML	,"Документ HTML (*.htm)"			,,БиблиотекаКартинок.ФорматHTML);
	СписокВыбораФормата.Добавить(ТипФайлаТабличногоДокумента.HTML3	,"Документ HTML 3 (*.htm)"			,,БиблиотекаКартинок.ФорматHTML);
	СписокВыбораФормата.Добавить(ТипФайлаТабличногоДокумента.HTML4	,"Документ HTML 4 (*.htm)"			,,БиблиотекаКартинок.ФорматHTML);
	СписокВыбораФормата.Добавить(ТипФайлаТабличногоДокумента.HTML5	,"Документ HTML 5 (*.htm)"			,,БиблиотекаКартинок.ФорматHTML);
	
	Возврат СписокВыбораФормата;
	
КонецФункции


&НаКлиенте
Процедура СохранитьКак(Команда)   
	
	СтрокаТекущая = Элементы.ДеревоПФ.ТекущаяСтрока;
	ИмяФайлаБезРасширения = ПолучитьИмяФайлаБезРасширения(СтрокаТекущая);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяФормата", 	"MXL");          
	ПараметрыФормы.Вставить("ВключитьXLSX",	Истина);  
	ПараметрыФормы.Вставить("ИмяФайла",		ИмяФайлаБезРасширения);  
	
	ОткрытьФорму("ОбщаяФорма.CW_СохранениеДокумента", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

 &НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.CW_СохранениеДокумента") Тогда
		
		ТекущаяСтрока = Элементы.ДеревоПФ.ТекущаяСтрока;

		Если ВыбранноеЗначение <> Неопределено 
			И ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
			
			Если ВыбранноеЗначение.ВариантСохранения = "СохранитьВПапку" Тогда
				СохранитьФайлыВКаталог(ВыбранноеЗначение);
			Иначе
				ЗаписатьФайлыНаСервере(ВыбранноеЗначение, ТекущаяСтрока);
				Оповестить("ОбновитьНаличиеПрикрепленныхФайлов");
				Состояние(НСтр("ru= 'Сохранение успешно завершено.'"));
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетСохранитьКак(Команда)
	
	СписокВыбораФормата = ПолучитьФорматыТабличногоДоумента();
	
	ПараметрыСохранения = новый Структура;
	ПараметрыСохранения.Вставить("РежимПакет",	Истина);
	ПараметрыСохранения.Вставить("ОдинФайл",	Ложь);
	ПараметрыСохранения.Вставить("СписокВыбораФормата", СписокВыбораФормата);
	
	ПродолжитьСохранениеДокумента(ПараметрыСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетСохранитьКакОдинФайл(Команда)
	
	СписокВыбораФормата = ПолучитьФорматыПакета();
	
	ПараметрыСохранения = новый Структура;
	ПараметрыСохранения.Вставить("ОдинФайл", 	Истина);
	ПараметрыСохранения.Вставить("РежимПакет",	Истина);
	ПараметрыСохранения.Вставить("СписокВыбораФормата", СписокВыбораФормата);
	
	ПродолжитьСохранениеДокумента(ПараметрыСохранения);
	
КонецПроцедуры


&НаКлиенте
Процедура ПродолжитьСохранениеДокумента(ПараметрыСохранения)
	
	МассивПараметровСохраняемыхФайлов = ПолучитьМассивПараметровСохраняемыхФайлов(ПараметрыСохранения.РежимПакет);
	
	Если МассивПараметровСохраняемыхФайлов.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Нет данных для сохранения!");
		Возврат;	
	КонецЕсли;
	
	Если ПараметрыСохранения.РежимПакет Тогда
		Если ПараметрыСохранения.ОдинФайл Тогда
			Режим =	РежимДиалогаВыбораФайла.Сохранение;
		Иначе
			Режим =	РежимДиалогаВыбораФайла.ВыборКаталога;
		КонецЕсли;
	Иначе
		Режим =	РежимДиалогаВыбораФайла.Сохранение;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Режим"				, Режим);
	ДополнительныеПараметры.Вставить("ОдинФайл"				, ПараметрыСохранения.ОдинФайл);
	ДополнительныеПараметры.Вставить("ДанныеДляСохранения"  , МассивПараметровСохраняемыхФайлов);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораФорматаСохранения",ЭтотОбъект, ДополнительныеПараметры); 
	
	ПараметрыСохранения.СписокВыбораФормата.ПоказатьВыборЭлемента(ОписаниеОповещения,"Выберите формат файла");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФорматаСохранения(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> Неопределено Тогда
		
		СоответствиеРасширений 	= ПодготвитьСоответствиеТиповФайловИРасширений();
		Расширение				= СоответствиеРасширений.Получить(Ответ.Значение);
		
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(ДополнительныеПараметры.Режим);
		
		Если ДополнительныеПараметры.Режим = РежимДиалогаВыбораФайла.Сохранение тогда
			СоответствиеФильтров 	= ПодготвитьСоответствиеТиповФайловИФильтров();
			
			Если ДополнительныеПараметры.ОдинФайл Тогда
				ПредставлениеИмениФайла = "Пакет документов";	
			Иначе
				ДанныеДляСохранения 	= ДополнительныеПараметры.ДанныеДляСохранения[0];
				ПредставлениеИмениФайла	= СтрЗаменить(СокрЛП(ДанныеДляСохранения.Представление),"/","-");
				ПредставлениеИмениФайла	= СтрЗаменить(СокрЛП(ПредставлениеИмениФайла),".","-");
			КонецЕсли;
			
			ДиалогОткрытияФайла.ПолноеИмяФайла 		= ПредставлениеИмениФайла;
			ДиалогОткрытияФайла.Фильтр 				= СоответствиеФильтров.Получить(Ответ.Значение);
			ДиалогОткрытияФайла.Заголовок 			= "Укажите имя файла...";
			
		Иначе
			ДиалогОткрытияФайла.Заголовок 			= "Укажите каталог для сохранения...";
		КонецЕсли;
		
		ДиалогОткрытияФайла.МножественныйВыбор 	= Ложь;
		
		СтруктураДопПараметров = Новый Структура;
		СтруктураДопПараметров.Вставить("Режим"						, ДополнительныеПараметры.Режим);
		СтруктураДопПараметров.Вставить("ОдинФайл"					, ДополнительныеПараметры.ОдинФайл);
		СтруктураДопПараметров.Вставить("ФорматФайла"				, Ответ.Значение);
		СтруктураДопПараметров.Вставить("Расширение"				, Расширение);
		СтруктураДопПараметров.Вставить("ДанныеДляСохранения"		, ДополнительныеПараметры.ДанныеДляСохранения);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаСохраненияФайлов",ЭтотОбъект, СтруктураДопПараметров); 
		ДиалогОткрытияФайла.Показать(ОписаниеОповещения);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСохраненияФайлов(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> Неопределено Тогда
		
		ИмяФайлаИзДанных = ложь;
		Если ДополнительныеПараметры.Режим = РежимДиалогаВыбораФайла.Сохранение Тогда
			//Получили полное имя файла
			ПолноеИмяФайла =  Ответ[0];
		Иначе
			//Получили имя каталога
			ИмяФайлаИзДанных 	= Истина;
			ПолноеИмяФайла 		= СокрЛП(Ответ[0]) + ?(Прав(СокрЛП(Ответ[0]),1)="\","","\");
		КонецЕсли;
		
		МассивДанныхДляСохранения = Новый Массив;
		Для Каждого  ДанныеДляСохранения из ДополнительныеПараметры.ДанныеДляСохранения Цикл
			ПараметрыСохранения = Новый Структура;
			ПараметрыСохранения.Вставить("АдресДанных"			, ДанныеДляСохранения.АдресДанных);
			ПараметрыСохранения.Вставить("Представление"		, ДанныеДляСохранения.Представление);
			ПараметрыСохранения.Вставить("ФорматФайла"			, ДополнительныеПараметры.ФорматФайла);
			ПараметрыСохранения.Вставить("ПолноеИмяФайла"		, ПолноеИмяФайла);
			ПараметрыСохранения.Вставить("ИмяФайлаИзДанных"		, ИмяФайлаИзДанных);
			ПараметрыСохранения.Вставить("Расширение"			, ДополнительныеПараметры.Расширение);
			
			Если ДополнительныеПараметры.ОдинФайл Тогда
				МассивДанныхДляСохранения.Добавить(ПараметрыСохранения);
			Иначе
				ЗаписатьДанныеВФайлы(ПараметрыСохранения);
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивДанныхДляСохранения.Количество() > 0 Тогда
			ЗаписатьДанныеВПакет(МассивДанныхДляСохранения, ПолноеИмяФайла, ДополнительныеПараметры.ФорматФайла);
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеВФайлы(ПараметрыСохранения)
	
	ТабличныйДокумент = ПолучитьИзВременногоХранилища(ПараметрыСохранения.АдресДанных);
	
	Если ПараметрыСохранения.ИмяФайлаИзДанных Тогда
		ПредставлениеИмениФайла	= СтрЗаменить(СокрЛП(ПараметрыСохранения.Представление),"/","-");
		ПредставлениеИмениФайла	= СтрЗаменить(СокрЛП(ПредставлениеИмениФайла),".","-");
		
		ИмяФайлаСохранения  = ПараметрыСохранения.ПолноеИмяФайла + ПредставлениеИмениФайла + ПараметрыСохранения.Расширение;
	Иначе
		ИмяФайлаСохранения = ПараметрыСохранения.ПолноеИмяФайла;	
	КонецЕсли;
	
	ТабличныйДокумент.Записать(ИмяФайлаСохранения,ПараметрыСохранения.ФорматФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеВПакет(МассивДанныхДляСохранения, ПолноеИмяФайла, ТипФайла)
	
	Пакет = Новый ПакетОтображаемыхДокументов;
	
	Для Каждого ПараметрыСохранения из МассивДанныхДляСохранения Цикл
		ТабличныйДокумент = ПолучитьИзВременногоХранилища(ПараметрыСохранения.АдресДанных);
		
		ЭлементПакета = Пакет.Состав.Добавить();
		ЭлементПакета.Данные 		= ПоместитьВоВременноеХранилище(ТабличныйДокумент, Новый УникальныйИдентификатор);
		ЭлементПакета.Наименование 	= ПараметрыСохранения.Представление;
	КонецЦикла;
	
	Попытка
		Пакет.Записать(ПолноеИмяФайла, ТипФайла);
	Исключение
		ПоказатьПредупреждение(,"Не удалось сохранить документы в выбранном формате. 
		|Выберите другой формат файла для сохранения докментов.",,"Ошибка сохранения документов");
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМассивПараметровСохраняемыхФайлов(РежимПакет)
	
	МассивПараметровСохраняемыхФайлов = Новый Массив;
	
	Если РежимПакет Тогда
		МассивЭлементовДерева = ДеревоПФ.ПолучитьЭлементы();
		НайтивДеревеПечатныхФормОтмеченныеЭлементы(МассивЭлементовДерева,МассивПараметровСохраняемыхФайлов);
	Иначе
		ДанныеТекущиейСтроки = Элементы.ДеревоПФ.ТекущиеДанные;
		МассивПараметровСохраняемыхФайлов.Добавить(Новый Структура("АдресДанных, Представление", ДанныеТекущиейСтроки.Адрес, ДанныеТекущиейСтроки.Представление));
	КонецЕсли;
	
	Возврат МассивПараметровСохраняемыхФайлов;
	
КонецФункции

&НаКлиенте
Процедура НайтивДеревеПечатныхФормОтмеченныеЭлементы(МассивЭлементовДерева, МассивПараметровСохраняемыхФайлов)
	
	Для Каждого СтрокаДерева Из МассивЭлементовДерева Цикл
		Если  СтрокаДерева.Группа Тогда
			НайтивДеревеПечатныхФормОтмеченныеЭлементы(СтрокаДерева.ПолучитьЭлементы(),МассивПараметровСохраняемыхФайлов);
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДерева.Печать <> 0 Тогда
			Если ЭтоАдресВременногоХранилища(СтрокаДерева.Адрес) Тогда
				МассивПараметровСохраняемыхФайлов.Добавить(Новый Структура("АдресДанных, Представление", СтрокаДерева.Адрес, СтрокаДерева.Представление));
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПодготвитьСоответствиеТиповФайловИРасширений()
	
	СоответствиеРасширений = новый Соответствие;
	СоответствиеРасширений.Вставить(ТипФайлаТабличногоДокумента.PDF	,".pdf");
	СоответствиеРасширений.Вставить(ТипФайлаТабличногоДокумента.MXL	,".mxl");
	СоответствиеРасширений.Вставить(ТипФайлаТабличногоДокумента.MXL7,".mxl");
	СоответствиеРасширений.Вставить(ТипФайлаТабличногоДокумента.XLS	,".xls");
	СоответствиеРасширений.Вставить(ТипФайлаТабличногоДокумента.XLSX,".xlsx");
	СоответствиеРасширений.Вставить(ТипФайлаТабличногоДокумента.ODS	,".ods");
	СоответствиеРасширений.Вставить(ТипФайлаТабличногоДокумента.DOCX,".docx");
	СоответствиеРасширений.Вставить(ТипФайлаТабличногоДокумента.TXT	,".txt");
	
	СоответствиеРасширений.Вставить(ТипФайлаТабличногоДокумента.HTML,".htm");
	СоответствиеРасширений.Вставить(ТипФайлаТабличногоДокумента.HTML3,".htm");
	СоответствиеРасширений.Вставить(ТипФайлаТабличногоДокумента.HTML4,".htm");
	СоответствиеРасширений.Вставить(ТипФайлаТабличногоДокумента.HTML5,".htm");
	
	Возврат СоответствиеРасширений;
	
КонецФункции

&НаКлиенте
Функция ПодготвитьСоответствиеТиповФайловИФильтров()
	
	СоответствиеФильтров = новый Соответствие;
	СоответствиеФильтров.Вставить(ТипФайлаТабличногоДокумента.PDF	,"Файлы .pdf (*.pdf)|*.pdf");
	СоответствиеФильтров.Вставить(ТипФайлаТабличногоДокумента.MXL	,"Файлы .mxl (*.mxl)|*.mxl");
	СоответствиеФильтров.Вставить(ТипФайлаТабличногоДокумента.MXL7	,"Файлы .mxl (версия 7) (*.mxl)|*.mxl");
	СоответствиеФильтров.Вставить(ТипФайлаТабличногоДокумента.XLS	,"Файлы .xls (*.xls)|*.xls");
	СоответствиеФильтров.Вставить(ТипФайлаТабличногоДокумента.XLSX	,"Файлы .xlsx (*.xlsx)|*.xlsx");
	СоответствиеФильтров.Вставить(ТипФайлаТабличногоДокумента.ODS	,"Файлы .ods (*.ods)|*.ods");
	СоответствиеФильтров.Вставить(ТипФайлаТабличногоДокумента.DOCX	,"Файлы .docx (*.docx)|*.docx");
	
	СоответствиеФильтров.Вставить(ТипФайлаТабличногоДокумента.HTML	,"Документ HTML (*.htm)|*.htm");
	СоответствиеФильтров.Вставить(ТипФайлаТабличногоДокумента.HTML3	,"Документ HTML 3 (*.htm)|*.htm");
	СоответствиеФильтров.Вставить(ТипФайлаТабличногоДокумента.HTML4	,"Документ HTML 4 (*.htm)|*.htm");
	СоответствиеФильтров.Вставить(ТипФайлаТабличногоДокумента.HTML5	,"Документ HTML 5 (*.htm)|*.htm");
	
	//Для пакетного сохранения
	СоответствиеФильтров.Вставить(ТипФайлаПакетаОтображаемыхДокументов.PDF	,"Файлы .pdf (*.pdf)|*.pdf");
	СоответствиеФильтров.Вставить(ТипФайлаПакетаОтображаемыхДокументов.XLS	,"Файлы .xls (*.xls)|*.xls");
	СоответствиеФильтров.Вставить(ТипФайлаПакетаОтображаемыхДокументов.XLSX	,"Файлы .xlsx (*.xlsx)|*.xlsx");
	СоответствиеФильтров.Вставить(ТипФайлаПакетаОтображаемыхДокументов.ODS	,"Файлы .ods (*.ods)|*.ods");
	СоответствиеФильтров.Вставить(ТипФайлаПакетаОтображаемыхДокументов.DOCX	,"Файлы .docx (*.docx)|*.docx");
	
	СоответствиеФильтров.Вставить(ТипФайлаПакетаОтображаемыхДокументов.HTML4	,"Документ HTML 4 (*.htm)|*.htm");
	СоответствиеФильтров.Вставить(ТипФайлаПакетаОтображаемыхДокументов.HTML5	,"Документ HTML 5 (*.htm)|*.htm");
	
	Возврат СоответствиеФильтров;
	
КонецФункции


&НаКлиенте
Процедура ПечатьПакета(Команда)
	
	ПодготовитьИНапечататьПакетДокументов(РежимИспользованияДиалогаПечати.Использовать);
	
КонецПроцедуры  

 &НаКлиенте
Процедура ПечатьПакетаСразу(Команда)
	 
	ПодготовитьИНапечататьПакетДокументов(РежимИспользованияДиалогаПечати.НеИспользовать);  
	
КонецПроцедуры 

&НаКлиенте
Функция ПодготовитьИНапечататьПакетДокументов(Знач РежимДиалогаПечати) 

	ПакетДокументов = Новый ПакетОтображаемыхДокументов;   
	
	Для каждого СтрокаДерева Из ДеревоПФ.ПолучитьЭлементы() Цикл
		ДобавитьДокументВПакет(ПакетДокументов, СтрокаДерева);
	КонецЦикла;
	
	ПакетДокументов.Напечатать(РежимДиалогаПечати);
	
КонецФункции 

&НаКлиенте
Процедура ДобавитьДокументВПакет(ПакетДокументов, СтрокаДерева) 
	
	Если СтрокаДерева.Печать = 0 Тогда 
		Для каждого ПодчиненнаяСтрока Из СтрокаДерева.ПолучитьЭлементы() Цикл
			ДобавитьДокументВПакет(ПакетДокументов, ПодчиненнаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
	Если СтрокаДерева.Печать <> 0 Тогда
		Если СтрокаДерева.Группа Тогда
			Возврат;
		КонецЕсли; 
		
		ВремТабличныйДокумент = ПолучитьИзВременногоХранилища(СтрокаДерева.Адрес);
		
		Для Экземпляр = 1 по СтрокаДерева.Количество Цикл 
			
			АдресДокумента = ПоместитьВоВременноеХранилище(ВремТабличныйДокумент, Новый УникальныйИдентификатор);
			
			ЭлементПакета =	ПакетДокументов.Состав.Добавить();
			ЭлементПакета.Данные 		= АдресДокумента;
			ЭлементПакета.Наименование 	= СтрокаДерева.Представление;
		КонецЦикла;
		
	КонецЕсли;           
	
КонецПроцедуры


&НаКлиенте
Процедура ПечатьТекущего(Команда)
	
	НапечататьДокумент(РежимИспользованияДиалогаПечати.Использовать);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПечатьТекущегоСразу(Команда)  
	
	НапечататьДокумент(РежимИспользованияДиалогаПечати.НеИспользовать); 
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьДокумент(РежимДиалогаПечати)
	
	ТекущийТД.Напечатать(РежимДиалогаПечати);
	
КонецПроцедуры




&НаКлиенте
Процедура ТекущийРедактировать(Команда)
	
	РежимРедактированияТабличногоДокумента = Не РежимРедактированияТабличногоДокумента;
	
	ТекущиеДанные = Элементы.ДеревоПФ.ТекущиеДанные;
	Если (ТекущиеДанные.Группа) Тогда
		Возврат;
	КонецЕсли; 
	
	Элементы.ТекущийТД.Редактирование 		= РежимРедактированияТабличногоДокумента;
	Элементы.ТекущийТД.Защита 				= Не РежимРедактированияТабличногоДокумента;
	Элементы.ТекущийТД.ТолькоПросмотр 		= Не РежимРедактированияТабличногоДокумента;
	Элементы.ТекущийТД.ОтображатьСетку 		= РежимРедактированияТабличногоДокумента;
	Элементы.ТекущийТД.ОтображатьЗаголовки 	= РежимРедактированияТабличногоДокумента;
	
	Элементы.РедактироватьТекущий.Пометка 	= РежимРедактированияТабличногоДокумента;
	
	Если Не РежимРедактированияТабличногоДокумента Тогда
		ЗаписатьМакетВДеревоПечатныхФорм( Элементы.ДеревоПФ.ТекущаяСтрока)
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаписатьМакетВДеревоПечатныхФорм(Идентификатор)
	
	СтрокаДерева = ДеревоПФ.НайтиПоИдентификатору(Идентификатор);
	СтрокаДерева.Адрес = ПоместитьВоВременноеХранилище(ТекущийТД,ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьПоЭлектроннойПочте(Команда)
	
	Если СписокОбъектовПечати.Количество() = 1 Тогда
		ДанныеДляЗаполненияШаблона = СписокОбъектовПечати.Получить(0).Значение;	
	КонецЕсли;
	
	МассивПараметров = ПолучитьМассивСтруктурПараметровДляПечати(ДанныеДляЗаполненияШаблона);
	
	Для Каждого СтруктураПараметров из МассивПараметров Цикл
		ОткрытьФорму("ОбщаяФорма.CW_ФормаОтправкиДокументов", СтруктураПараметров);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСтруктурПараметровДляПечати(тДанныеДляЗаполненияШаблона=Неопределено)
	
	Результат = Новый Массив;
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("АдресТабДок");
	ТаблицаДанных.Колонки.Добавить("АдресЭлПочты");
	ТаблицаДанных.Колонки.Добавить("АдресЭлПочтыКопия");
	ТаблицаДанных.Колонки.Добавить("АдресЭлПочтыСкрытаяКопия");
	ТаблицаДанных.Колонки.Добавить("ШаблонПисьма");
	ТаблицаДанных.Колонки.Добавить("ДанныеДляЗаполненияШаблона");
	ТаблицаДанных.Колонки.Добавить("Представление");
	
	ДеревоПечатныхФорм = РеквизитФормыВЗначение("ДеревоПФ");
	
	ОтборСтрокДерева = Новый Структура("Группа, Печать", Ложь, 1);
	СтрокиДерева = ДеревоПечатныхФорм.Строки.НайтиСтроки(ОтборСтрокДерева, Истина);
	
	Для Каждого СтрокаДерева из СтрокиДерева Цикл
		СтрокаТаблицы = ТаблицаДанных.Добавить();
		СтрокаТаблицы.АдресТабДок 					= СтрокаДерева.Адрес;
		СтрокаТаблицы.АдресЭлПочты					= СтрокаДерева.АдресЭлПочты;
		СтрокаТаблицы.АдресЭлПочтыКопия				= СтрокаДерева.АдресЭлПочтыКопия;
		СтрокаТаблицы.АдресЭлПочтыСкрытаяКопия		= СтрокаДерева.АдресЭлПочтыСкрытаяКопия;
		СтрокаТаблицы.ШаблонПисьма					= СтрокаДерева.ШаблонПисьма;
		СтрокаТаблицы.ДанныеДляЗаполненияШаблона	= СтрокаДерева.ДанныеДляЗаполненияШаблона;
		СтрокаТаблицы.Представление					= СтрокаДерева.Представление;
	КонецЦикла;
	
	СвёрнутаяТаблицаДанных = ТаблицаДанных.Скопировать(, "АдресЭлПочты,АдресЭлПочтыКопия,АдресЭлПочтыСкрытаяКопия,ШаблонПисьма, ДанныеДляЗаполненияШаблона");
	СвёрнутаяТаблицаДанных.Свернуть("АдресЭлПочты,АдресЭлПочтыКопия,АдресЭлПочтыСкрытаяКопия, ШаблонПисьма, ДанныеДляЗаполненияШаблона");
	
	Для Каждого СтрокаТаблицы Из СвёрнутаяТаблицаДанных Цикл
		
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("АдресЭлПочты",					СтрокаТаблицы.АдресЭлПочты);
		ОтборСтрок.Вставить("АдресЭлПочтыКопия",			СтрокаТаблицы.АдресЭлПочтыКопия);
		ОтборСтрок.Вставить("АдресЭлПочтыСкрытаяКопия",		СтрокаТаблицы.АдресЭлПочтыСкрытаяКопия);
		ОтборСтрок.Вставить("ШаблонПисьма",					СтрокаТаблицы.ШаблонПисьма);
		ОтборСтрок.Вставить("ДанныеДляЗаполненияШаблона",	СтрокаТаблицы.ДанныеДляЗаполненияШаблона);
		
		мСтроки = ТаблицаДанных.НайтиСтроки(ОтборСтрок);
		
		ТаблицаПечатныхФорм = ТаблицаДанных.Скопировать(мСтроки, "АдресТабДок, Представление");
		
		АдресТаблицыПечатныхФорм = ПоместитьВоВременноеХранилище(ТаблицаПечатныхФорм, УникальныйИдентификатор);
		
		ПараметрыФормыПечати = Новый Структура;
		ПараметрыФормыПечати.Вставить("Получатели",				СтрокаТаблицы.АдресЭлПочты);
		ПараметрыФормыПечати.Вставить("ПолучателиКопия",		СтрокаТаблицы.АдресЭлПочтыКопия);
		ПараметрыФормыПечати.Вставить("ПолучателиСкрытаяКопия",	СтрокаТаблицы.АдресЭлПочтыСкрытаяКопия);
		ПараметрыФормыПечати.Вставить("ШаблонПисьма",			СтрокаТаблицы.ШаблонПисьма);
		
		ДанныеДляЗаполненияШаблона =  ?(ЗначениеЗаполнено(СтрокаТаблицы.ДанныеДляЗаполненияШаблона),СтрокаТаблицы.ДанныеДляЗаполненияШаблона, тДанныеДляЗаполненияШаблона);
		ПараметрыФормыПечати.Вставить("ДанныеДляЗаполненияШаблона",	ДанныеДляЗаполненияШаблона);
		
		ПараметрыФормыПечати.Вставить("АдресТаблицыПечатныхФорм",	АдресТаблицыПечатныхФорм); 
		
		ПараметрыФормыПечати.Вставить("ПечатныеФормыПодготовлены",	Истина); 
		
		Результат.Добавить(ПараметрыФормыПечати);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура РекурсивныйОбходДереваДляТаблицыПечатаемыхФорм(СтрокаДерева, тз) Экспорт 
	
	Если (СтрокаДерева.Печать <> 0) Тогда
		
		Если (НЕ СтрокаДерева.Группа) Тогда
			
			строкаТЗ = тз.Добавить();
			строкаТЗ.ШаблонПисьма = Неопределено;
			строкаТЗ.АдресТабДок = СтрокаДерева.Адрес;
			строкаТЗ.АдресЭлПочты= СтрокаДерева.АдресЭлПочты;
			строкаТЗ.ШаблонПисьма= СтрокаДерева.ШаблонПисьма;
			строкаТЗ.ДанныеДляЗаполненияШаблона= СтрокаДерева.ДанныеДляЗаполненияШаблона;
			строкаТЗ.Представление= СтрокаДерева.Представление;
			
		КонецЕсли;
		
	Иначе
		
		Для каждого Стр Из СтрокаДерева.ПолучитьЭлементы() Цикл
			
			РекурсивныйОбходДереваДляТаблицыПечатаемыхФорм(Стр, тз);
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВыключитьИерархию(Команда)
	
	ОбновитьДеревоНаСервере();
	если ДеревоСписок Тогда
		РазвернутьСтроки();
	Конецесли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоНаСервере()
	
	Если ЭтоАдресВременногоХранилища(АдресПакетаФорм) Тогда
		
		ДеревоСписок = Не ДеревоСписок;
		
		ЭлементыДерева = ДеревоПФ.ПолучитьЭлементы();
		ЭлементыДерева.Очистить();
		
		СтруктураПакета = ПолучитьИзВременногоХранилища(АдресПакетаФорм);
		_ЗаполнитьДерево(СтруктураПакета,ДеревоПФ);
		ОбновитьОтображениеКнопки();
		УстановитьТекущуюСтрокуДерева(ДеревоПФ);	
		
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРазвернуть(Команда)
	РазвернутьСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСвернуть(Команда)
	СвернутьСтроки();
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьСтроки()
	
	КоллекцияЭлементовДерева = ДеревоПФ.ПолучитьЭлементы();
	
	//Развернуть дерево 
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл 
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
		Элементы.ДеревоПФ.Развернуть(ИдентификаторСтроки);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьСтроки()
	
	КоллекцияЭлементовДерева = ДеревоПФ.ПолучитьЭлементы();
	
	//Развернуть дерево 
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл 
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
		Элементы.ДеревоПФ.Свернуть(ИдентификаторСтроки);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийТДОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка =Ложь;
КонецПроцедуры

&наСервере
Процедура ОбновитьОтображениеКнопки()
	
	Элементы.ДеревоПФВключитьВыключитьИерархию.Видимость 	= Не ОдинДокумент или НеОтключатьИерархиюФорм;	
	Элементы.ГруппадеревоРазвренутьСвернуть.Видимость 		= ДеревоСписок или НеОтключатьИерархиюФорм;
	
	Если Не ОдинДокумент Тогда
		Элементы.ДеревоПФВключитьВыключитьИерархию.Картинка = ?(ДеревоСписок, БиблиотекаКартинок.CW_Меню2, БиблиотекаКартинок.CW_Подразделения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИмяОбработкиПриИзменении(Элемент)
	Элементы.ДеревоПФНавигационнаяСсылкаПредставление.Видимость = ПоказатьИмяОбработки;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПФВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.ГиперссылкаЯчейки Тогда
		СтандартнаяОбработка 	= Ложь;
		
		Если Поле.Имя = "ДеревоПФНавигационнаяСсылкаПредставление" Тогда
			ПерейтиПоНавигационнойСсылке(Элементы.ДеревоПФ.ТекущиеДанные.НавигационнаяСсылка);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры


//Сохранение печатной формы
&НаКлиенте
Процедура СохранитьФайлыВКаталог(Знач ВыбранноеЗначение)
	
	МассивДанных = ПоместитьФайлыВоВременноеХранилищеНаСервере(ВыбранноеЗначение);
	
	#Если ВебКлиент Тогда
		Для Каждого Элемент Из МассивДанных Цикл
			ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
			ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
			
			НачатьПолучениеФайлаССервера(Элемент.АдресВоВременномХранилище, Элемент.Представление, ПараметрыДиалогаПолученияФайлов);
		КонецЦикла;
	#Иначе 
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("КаталогДляСохранения", ВыбранноеЗначение.КаталогДляСохранения);
	
		ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьФайлыВКаталогЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		КаталогДляСохранения = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ВыбранноеЗначение.КаталогДляСохранения);
		
		ПолучаемыеФайлы = Новый Массив;
		Для Каждого Элемент Из МассивДанных Цикл
		
			ПолучаемыйФайл 			= Новый ОписаниеПередаваемогоФайла;
			ПолучаемыйФайл.Имя 		= Элемент.Представление;
			ПолучаемыйФайл.Хранение = Элемент.АдресВоВременномХранилище;
			
			ПолучаемыеФайлы.Добавить(ПолучаемыйФайл);
		
		КонецЦикла;
		
		НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы, КаталогДляСохранения, Ложь);
		
	#КонецЕсли

КонецПроцедуры   

&НаСервере
Процедура ЗаписатьФайлыНаСервере(ВыбранноеЗначение, ТекущаяСтрока)  
	
	// подготовка временной папки
	ИмяВременнойПапки = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременнойПапки); 
	
	СтрокаТекущая = ДеревоПФ.НайтиПоИдентификатору(ТекущаяСтрока);
	
	ИмяФайлаБезРасширения = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(СокрЛП(ВыбранноеЗначение.ИмяФайла));

	Для Каждого ФорматФайла Из ВыбранноеЗначение.ФорматыСохранения Цикл
		
		Если ФорматФайла = "DOCX" Тогда
			// Подготовим DOCX документ на основе табличного документа
			ИмяФайла = ИмяФайлаБезРасширения+".docx";
			Расширение 	= ".docx";
			ПолноеИмяФайла = ПодготовитьDOCXНаОсновеТабличногоДокумента(ИмяВременнойПапки, ИмяФайла);
		ИначеЕсли ФорматФайла = "XLSX" Тогда
			// Подготовим XLSX документ на основе табличного документа
			ИмяФайла = ИмяФайлаБезРасширения + ".xlsx";
			Расширение 	= ".xlsx";
			ПолноеИмяФайла = ПодготовитьXLSXНаОсновеТабличногоДокумента(ИмяВременнойПапки, ИмяФайла); 
		ИначеЕсли ФорматФайла = "PDF" Тогда
			// Подготовим PDF документ на основе табличного документа
			ИмяФайла = ИмяФайлаБезРасширения + ".pdf";
			Расширение 	= ".pdf";
			ПолноеИмяФайла = ПодготовитьPDFНаОсновеТабличногоДокумента(ИмяВременнойПапки, ИмяФайла);
		ИначеЕсли ФорматФайла = "MXL" Тогда
			// Подготовим PDF документ на основе табличного документа
			ИмяФайла = ИмяФайлаБезРасширения + ".mxl";
			Расширение 	= ".mxl";
			ПолноеИмяФайла = ПодготовитьMXLНаОсновеТабличногоДокумента(ИмяВременнойПапки, ИмяФайла);
		ИначеЕсли ФорматФайла = "HTML" Тогда
			// Подготовим HTML документ на основе табличного документа
			ИмяФайла 	= ИмяФайлаБезРасширения + ".htm";
			Расширение 	= ".htm";
			ПолноеИмяФайла = ПодготовитьHTMLНаОсновеТабличногоДокумента(ИмяВременнойПапки, ИмяФайла);
		КонецЕсли;                          
		
		Если ПолучитьФункциональнуюОпцию("CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив") Тогда
			ТипДокумента = ВыбранноеЗначение.ТипДокумента;   
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТекущая.Ссылка) Тогда  
			
			ОбъектыАрхива = Новый Массив;
			ОбъектыАрхива.Добавить(СтрокаТекущая.Ссылка);  
			
			ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
			Хранение = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
			
			ДанныеФайла = Новый Структура;
			ДанныеФайла.Вставить("Имя",			ИмяФайла);
			ДанныеФайла.Вставить("Расширение",	Расширение);
			ДанныеФайла.Вставить("Хранение",	Хранение);
			
			ПомещенныеФайлы = Новый Массив;
			ПомещенныеФайлы.Добавить(ДанныеФайла);
			
			CW_РаботаСФайламиСервер.ПрикрепитьФайлы(ПомещенныеФайлы, ОбъектыАрхива, ТипДокумента); 
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Удалим временный файл.
	УдалитьВременныйФайлНаСервер(ИмяВременнойПапки);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяФайлаБезРасширения(Знач СтрокаТекущая)   
	
	ТекущаяСтрока =	ДеревоПФ.НайтиПоИдентификатору(СтрокаТекущая);
	
	Возврат ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(СокрЛП(ТекущаяСтрока.Представление));

КонецФункции

&НаКлиенте
Процедура СохранитьФайлыВКаталогЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт

	Если ПолученныеФайлы = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'При сохранении возникла ошибка'"));
	Иначе
		Состояние(НСтр("ru = 'Сохранение успешно завершено'"), , НСтр("ru = 'в папку:'") + " " + ДополнительныеПараметры.КаталогДляСохранения);
	КонецЕсли;

КонецПроцедуры   

&НаСервере
Функция ПоместитьФайлыВоВременноеХранилищеНаСервере(ВыбранноеЗначение)

	Папка = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(Папка);
	
	// Указываем имя файла вложения
	ИмяФайлаБезРасширения = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(СокрЛП(ВыбранноеЗначение.ИмяФайла));
	
	МассивДанных = Новый Массив;
	Для Каждого ФорматФайла Из ВыбранноеЗначение.ФорматыСохранения Цикл
		
		Если ФорматФайла = "DOCX" Тогда
			ИмяФайла = ИмяФайлаБезРасширения + ".docx";
			// Подготовим DOCX документ на основе табличного документа
			ПолноеИмяФайла = ПодготовитьDOCXНаОсновеТабличногоДокумента(Папка, ИмяФайла);
		ИначеЕсли ФорматФайла = "PDF" Тогда
			ИмяФайла = ИмяФайлаБезРасширения + ".pdf";
			// Подготовим PDF документ на основе табличного документа
			ПолноеИмяФайла = ПодготовитьPDFНаОсновеТабличногоДокумента(Папка, ИмяФайла);
		ИначеЕсли ФорматФайла = "MXL" Тогда
			ИмяФайла = ИмяФайлаБезРасширения + ".mxl";
			// Подготовим PDF документ на основе табличного документа
			ПолноеИмяФайла = ПодготовитьMXLНаОсновеТабличногоДокумента(Папка, ИмяФайла); 
		ИначеЕсли ФорматФайла = "XLSX" Тогда
			ИмяФайла = ИмяФайлаБезРасширения + ".xlsx";
			// Подготовим XLSX документ на основе табличного документа
			ПолноеИмяФайла = ПодготовитьXLSXНаОсновеТабличногоДокумента(Папка, ИмяФайла); 
		КонецЕсли;
		
		ДвоичныеДанные 				= Новый ДвоичныеДанные(ПолноеИмяФайла);
		ПутьВоВременномХранилище 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтотОбъект.УникальныйИдентификатор);   
		
		ОписаниеФайла = Новый Структура;
		ОписаниеФайла.Вставить("Представление", ИмяФайла);
		ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
		
		МассивДанных.Добавить(ОписаниеФайла);
		
	КонецЦикла;  
	
	УдалитьВременныйФайлНаСервер(Папка);
	
	Возврат МассивДанных;

КонецФункции

&НаСервере
Функция ПодготовитьDOCXНаОсновеТабличногоДокумента(ИмяПапки, ИмяФайла)
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла);
	ТекущийТД.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.DOCX);
	
	Возврат ПолноеИмяФайла;
	
КонецФункции  

&НаСервере
Функция ПодготовитьXLSXНаОсновеТабличногоДокумента(ИмяПапки, ИмяФайла)
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла);
	ТекущийТД.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	Возврат ПолноеИмяФайла;
	
КонецФункции 

&НаСервере
Функция ПодготовитьPDFНаОсновеТабличногоДокумента(ИмяПапки, ИмяФайла)
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла);
	ТекущийТД.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.PDF);
	
	Возврат ПолноеИмяФайла;
	
КонецФункции   

&НаСервере
Функция ПодготовитьMXLНаОсновеТабличногоДокумента(ИмяПапки, ИмяФайла)
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла);
	ТекущийТД.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.MXL);
	
	Возврат ПолноеИмяФайла;
	
КонецФункции

&НаСервере
Функция ПодготовитьHTMLНаОсновеТабличногоДокумента(ИмяПапки, ИмяФайла)
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла);
	ТекущийТД.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.HTML);
	
	Возврат ПолноеИмяФайла;
	
КонецФункции

 &НаСервере
Процедура УдалитьВременныйФайлНаСервер(ИмяФайла)

	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;

	// Удалим временный файл.
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
		СведенияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось удалить временный файл по причине: %1'"),
			ПодробноеПредставлениеОшибки(СведенияОбОшибке));
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Сохранение текста документа.'", 
			ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка, , , 
			ТекстСообщения);
	КонецПопытки;

КонецПроцедуры   

 &НаСервереБезКонтекста
Функция УникальноеИмяФайла(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	ИмяБезРасширения 	= Файл.ИмяБезРасширения;
	Расширение 			= Файл.Расширение;
	Папка 				= Файл.Путь;
	
	Счетчик = 1;
	Пока Файл.Существует() Цикл
		Счетчик = Счетчик + 1;
		Файл = Новый Файл(Папка + ИмяБезРасширения + " (" + Счетчик + ")" + Расширение);
	КонецЦикла;
	
	Возврат Файл.ПолноеИмя;
	
КонецФункции
//--Сохранение печатной формы


#Область ВыводПодписиИПечатиВДокументах

&НаКлиенте
Процедура ПодписьИПечатьПриИзменении(Элемент)
	
	ЭлементыДерева = ДеревоПФ.ПолучитьЭлементы();
	
	Если Не ДеревоСписок Тогда
		Индекс = ЭлементыДерева.Индекс(Элементы.ДеревоПФ.ТекущиеДанные);
	Иначе
		ТекущийРодитель = Элементы.ДеревоПФ.ТекущиеДанные.ПолучитьРодителя();
		Если ТекущийРодитель = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ИндексРодителя 	= ЭлементыДерева.Индекс(ТекущийРодитель);
		
		ЭлементыРодителя = ТекущийРодитель.ПолучитьЭлементы();
		Индекс 			 = ЭлементыРодителя.Индекс(Элементы.ДеревоПФ.ТекущиеДанные);
	КонецЕсли;
	
	ОбработатьИзменениеФлагаНаСервере();
	
	Если Не ДеревоСписок Тогда
		Элементы.ДеревоПФ.ТекущаяСтрока = ДеревоПФ.ПолучитьЭлементы()[Индекс].ПолучитьИдентификатор();
	Иначе
		РодительТекущейСтроки 			= ДеревоПФ.ПолучитьЭлементы()[ИндексРодителя];
		Элементы.ДеревоПФ.ТекущаяСтрока = РодительТекущейСтроки.ПолучитьЭлементы()[Индекс].ПолучитьИдентификатор();
		РазвернутьСтроки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеФлагаНаСервере()
	
	Если ЭтоПакетнаяПечать Тогда
		
		мОбъектыПечати 	= Новый Массив;
		
		мСсылки = СписокОбъектовПечати.ВыгрузитьЗначения();
		МассивИменМетаданных	= CW_Печать.ПолучитьМассивИменМетеданных(мСсылки);
		
		СсылкаВМассиве  = мСсылки[0];
		Если ТипЗнч(СсылкаВМассиве)= Тип("ДокументСсылка.CW_ОтчетЭкспедитора") Тогда
			//Дополняем метаданые связанных документов
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	CW_ДокументыОтчетаЭкспедитора.ОтчетЭкспедитора КАК ОтчетЭкспедитора,
			|	CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент КАК СвязанныйДокумент
			|ИЗ
			|	РегистрСведений.CW_ДокументыОтчетаЭкспедитора КАК CW_ДокументыОтчетаЭкспедитора
			|ГДЕ
			|	CW_ДокументыОтчетаЭкспедитора.ОтчетЭкспедитора В(&ОтчетыЭкспедитора)
			|	И CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент.Проведен
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	CW_ОтчетЭкспедитораДокументыВознаграждения.Ссылка,
			|	CW_ОтчетЭкспедитораДокументыВознаграждения.Документ
			|ИЗ
			|	Документ.CW_ОтчетЭкспедитора.ДокументыВознаграждения КАК CW_ОтчетЭкспедитораДокументыВознаграждения
			|ГДЕ
			|	CW_ОтчетЭкспедитораДокументыВознаграждения.Ссылка В(&ОтчетыЭкспедитора)
			|	И CW_ОтчетЭкспедитораДокументыВознаграждения.Документ.Проведен
			|
			|УПОРЯДОЧИТЬ ПО
			|	СвязанныйДокумент УБЫВ
			|ИТОГИ ПО
			|	ОтчетЭкспедитора
			|АВТОУПОРЯДОЧИВАНИЕ";
			
			Запрос.УстановитьПараметр("ОтчетыЭкспедитора", мСсылки);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаОтчетЭкспедитора = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока  ВыборкаОтчетЭкспедитора.Следующий() Цикл
				
				мСвязанныеДокументы = Новый Массив;
				
				ВыборкаДетали = ВыборкаОтчетЭкспедитора.Выбрать();
				Пока ВыборкаДетали.Следующий() Цикл
					мСвязанныеДокументы.Добавить(ВыборкаДетали.СвязанныйДокумент);
				КонецЦикла;
				
				ОбъектПечати = Новый Структура;
				ОбъектПечати.Вставить("Ссылка", 			ВыборкаОтчетЭкспедитора.ОтчетЭкспедитора);
				ОбъектПечати.Вставить("СвязанныеДокументы", мСвязанныеДокументы);
				
				мОбъектыПечати.Добавить(ОбъектПечати);
				
			КонецЦикла;
			
		Иначе
			Для Каждого Ссылка из мСсылки Цикл
				ОбъектПечати = Новый Структура;
				ОбъектПечати.Вставить("Ссылка", 			Ссылка);
				
				мОбъектыПечати.Добавить(ОбъектПечати);
			КонецЦикла;
		Конецесли;
		
		ПараметрыПакетнойПечати = Новый Структура;
		ПараметрыПакетнойПечати.Вставить("ОбъектыПечати", 			мОбъектыПечати);
		ПараметрыПакетнойПечати.Вставить("МассивИменМетаданных", 	МассивИменМетаданных);
		
		ПараметрыПечати = CW_Печать.ПолучитьПараметрыФормыПакетнойПечати(ПараметрыПакетнойПечати,УникальныйИдентификатор, СписокПечатныхФорм, ПодписьИПечать) ;
	Иначе
		ПараметрыПечати = CW_Печать.ПолучитьПараметрыФормыПечати(СписокОбъектовПечати.ВыгрузитьЗначения(),УникальныйИдентификатор, ПодписьИПечать);
	КонецЕсли;
	
	Если (_УФКС.ВыполненоУспешно(ПараметрыПечати)) Тогда
		ДеревоПФ.ПолучитьЭлементы().Очистить();
		ОбновитьДанныеФормы(ПараметрыПечати.ПФ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
